由于数据量太大，单独建一个Notebook用于处理用户特征

In [1]:
# 数据处理工具
import pandas as pd
import numpy as np
import random as rnd
from collections import Counter
import utils

# 可视化工具
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
user_feature1 = pd.read_csv('data/user_feature1.csv')

In [3]:
user_feature2 = pd.read_csv('data/user_feature2.csv')

In [4]:
user_feature3 = pd.read_csv('data/user_feature3.csv')

In [5]:
user_feature4 = pd.read_csv('data/user_feature4.csv')

In [6]:
user_feature5 = pd.read_csv('data/user_feature5.csv')

In [7]:
user_feature_all = user_feature1.append(user_feature2).append(user_feature3).append(user_feature4).append(user_feature5)

In [2]:
column1 = ['uid', 'age', 'gender', 'marriageStatus', 'education', 'consumptionAbility', 'LBS', 'appIdInstall', 
           'appIdAction', 'ct', 'os', 'carrier', 'house']
column2 = ['interest1', 'interest2', 'interest3', 'interest4', 'interest5']
column3 = ['kw1', 'kw2', 'kw3']
column4 = ['topic1', 'topic2', 'topic3']

In [3]:
column = ['uid', 'age', 'gender', 'marriageStatus', 'education', 'consumptionAbility', 'LBS', 
          'interest1', 'interest2', 'interest3', 'interest4', 'interest5', 
          'kw1', 'kw2', 'kw3', 
          'topic1', 'topic2', 'topic3', 
          'appIdInstall', 'appIdAction', 'ct', 'os', 'carrier', 'house']

In [25]:
user_feature_all.to_csv('data/user_feature_all.csv', columns=column, index=False)

重新读入合并的user data数据

In [4]:
user_feature_all = pd.read_csv('data/user_feature_all.csv')

In [5]:
user_feature_all.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>uid</th>
      <th>age</th>
      <th>gender</th>
      <th>marriageStatus</th>
      <th>education</th>
      <th>consumptionAbility</th>
      <th>LBS</th>
      <th>interest1</th>
      <th>interest2</th>
      <th>interest3</th>
      <th>...</th>
      <th>kw3</th>
      <th>topic1</th>
      <th>topic2</th>
      <th>topic3</th>
      <th>appIdInstall</th>
      <th>appIdAction</th>
      <th>ct</th>
      <th>os</th>
      <th>carrier</th>
      <th>house</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>26325489</td>
      <td>4</td>
      <td>2</td>
      <td>11</td>
      <td>7</td>
      <td>2</td>
      <td>950.0</td>
      <td>['93', '70', '77', '86', '109', '47', '75', '6...</td>
      <td>['46', '19', '13', '29']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['9826', '105', '8525', '5488', '7281']</td>
      <td>['9708', '5553', '6745', '7477', '7150']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>2</td>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1184123</td>
      <td>2</td>
      <td>1</td>
      <td>['5', '13']</td>
      <td>2</td>
      <td>1</td>
      <td>803.0</td>
      <td>['75', '29']</td>
      <td>33</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['4391', '9140', '5669', '1348', '4388']</td>
      <td>['9401', '7724', '1380', '8890', '7153']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>76072711</td>
      <td>1</td>
      <td>1</td>
      <td>['13', '10']</td>
      <td>5</td>
      <td>1</td>
      <td>927.0</td>
      <td>['70', '12', '28', '106', '59', '49', '41', '6...</td>
      <td>['51', '22', '79', '81', '70', '6', '21', '4',...</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1502', '5488', '9826', '2187', '8088']</td>
      <td>['5005', '9154', '2756', '5612', '4209']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>3</th>
      <td>63071413</td>
      <td>4</td>
      <td>1</td>
      <td>11</td>
      <td>7</td>
      <td>1</td>
      <td>486.0</td>
      <td>['93', '70', '77', '47', '76', '75', '69', '29...</td>
      <td>['24', '70', '19', '13', '30', '10']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1619', '7342', '3064', '9213', '8525']</td>
      <td>['810', '2438', '5659', '1844', '9262']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['1', '3']</td>
      <td>['1', '2']</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>4</th>
      <td>81294159</td>
      <td>5</td>
      <td>1</td>
      <td>11</td>
      <td>6</td>
      <td>2</td>
      <td>112.0</td>
      <td>['75', '29', '49', '122', '36', '11']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['477', '9826', '5808', '644', '2747']</td>
      <td>['5483', '2199', '5424', '1511', '7751']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1', '4', '2']</td>
      <td>1</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
<p>5 rows × 24 columns</p>
</div>

In [7]:
user_feature_all.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11420039 entries, 0 to 11420038
Data columns (total 24 columns):
uid                   int64
age                   int64
gender                int64
marriageStatus        object
education             int64
consumptionAbility    int64
LBS                   float64
interest1             object
interest2             object
interest3             object
interest4             object
interest5             object
kw1                   object
kw2                   object
kw3                   object
topic1                object
topic2                object
topic3                object
appIdInstall          object
appIdAction           object
ct                    object
os                    object
carrier               int64
house                 float64
dtypes: float64(2), int64(6), object(16)
memory usage: 2.0+ GB

In [9]:
ages = Counter(user_feature_all['age'])
ages

Counter({0: 5832, 1: 2646609, 2: 2348005, 3: 1322315, 4: 2337992, 5: 2759286})

In [10]:
user_feature_all['age'] = user_feature_all['age'] / user_feature_all['age'].max()
user_feature_all.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>uid</th>
      <th>age</th>
      <th>gender</th>
      <th>marriageStatus</th>
      <th>education</th>
      <th>consumptionAbility</th>
      <th>LBS</th>
      <th>interest1</th>
      <th>interest2</th>
      <th>interest3</th>
      <th>...</th>
      <th>kw3</th>
      <th>topic1</th>
      <th>topic2</th>
      <th>topic3</th>
      <th>appIdInstall</th>
      <th>appIdAction</th>
      <th>ct</th>
      <th>os</th>
      <th>carrier</th>
      <th>house</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>26325489</td>
      <td>0.8</td>
      <td>2</td>
      <td>11</td>
      <td>7</td>
      <td>2</td>
      <td>950.0</td>
      <td>['93', '70', '77', '86', '109', '47', '75', '6...</td>
      <td>['46', '19', '13', '29']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['9826', '105', '8525', '5488', '7281']</td>
      <td>['9708', '5553', '6745', '7477', '7150']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>2</td>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1184123</td>
      <td>0.4</td>
      <td>1</td>
      <td>['5', '13']</td>
      <td>2</td>
      <td>1</td>
      <td>803.0</td>
      <td>['75', '29']</td>
      <td>33</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['4391', '9140', '5669', '1348', '4388']</td>
      <td>['9401', '7724', '1380', '8890', '7153']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>76072711</td>
      <td>0.2</td>
      <td>1</td>
      <td>['13', '10']</td>
      <td>5</td>
      <td>1</td>
      <td>927.0</td>
      <td>['70', '12', '28', '106', '59', '49', '41', '6...</td>
      <td>['51', '22', '79', '81', '70', '6', '21', '4',...</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1502', '5488', '9826', '2187', '8088']</td>
      <td>['5005', '9154', '2756', '5612', '4209']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>3</th>
      <td>63071413</td>
      <td>0.8</td>
      <td>1</td>
      <td>11</td>
      <td>7</td>
      <td>1</td>
      <td>486.0</td>
      <td>['93', '70', '77', '47', '76', '75', '69', '29...</td>
      <td>['24', '70', '19', '13', '30', '10']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1619', '7342', '3064', '9213', '8525']</td>
      <td>['810', '2438', '5659', '1844', '9262']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['1', '3']</td>
      <td>['1', '2']</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>4</th>
      <td>81294159</td>
      <td>1.0</td>
      <td>1</td>
      <td>11</td>
      <td>6</td>
      <td>2</td>
      <td>112.0</td>
      <td>['75', '29', '49', '122', '36', '11']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['477', '9826', '5808', '644', '2747']</td>
      <td>['5483', '2199', '5424', '1511', '7751']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1', '4', '2']</td>
      <td>1</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
<p>5 rows × 24 columns</p>
</div>

In [12]:
genders = Counter(user_feature_all['gender'])
genders

Counter({0: 35594, 1: 7768063, 2: 3616382})

In [13]:
user_feature_all['gender'] = user_feature_all['gender'] / user_feature_all['gender'].max()
user_feature_all.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>uid</th>
      <th>age</th>
      <th>gender</th>
      <th>marriageStatus</th>
      <th>education</th>
      <th>consumptionAbility</th>
      <th>LBS</th>
      <th>interest1</th>
      <th>interest2</th>
      <th>interest3</th>
      <th>...</th>
      <th>kw3</th>
      <th>topic1</th>
      <th>topic2</th>
      <th>topic3</th>
      <th>appIdInstall</th>
      <th>appIdAction</th>
      <th>ct</th>
      <th>os</th>
      <th>carrier</th>
      <th>house</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>26325489</td>
      <td>0.8</td>
      <td>1.0</td>
      <td>11</td>
      <td>7</td>
      <td>2</td>
      <td>950.0</td>
      <td>['93', '70', '77', '86', '109', '47', '75', '6...</td>
      <td>['46', '19', '13', '29']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['9826', '105', '8525', '5488', '7281']</td>
      <td>['9708', '5553', '6745', '7477', '7150']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>2</td>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1184123</td>
      <td>0.4</td>
      <td>0.5</td>
      <td>['5', '13']</td>
      <td>2</td>
      <td>1</td>
      <td>803.0</td>
      <td>['75', '29']</td>
      <td>33</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['4391', '9140', '5669', '1348', '4388']</td>
      <td>['9401', '7724', '1380', '8890', '7153']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>76072711</td>
      <td>0.2</td>
      <td>0.5</td>
      <td>['13', '10']</td>
      <td>5</td>
      <td>1</td>
      <td>927.0</td>
      <td>['70', '12', '28', '106', '59', '49', '41', '6...</td>
      <td>['51', '22', '79', '81', '70', '6', '21', '4',...</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1502', '5488', '9826', '2187', '8088']</td>
      <td>['5005', '9154', '2756', '5612', '4209']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>3</th>
      <td>63071413</td>
      <td>0.8</td>
      <td>0.5</td>
      <td>11</td>
      <td>7</td>
      <td>1</td>
      <td>486.0</td>
      <td>['93', '70', '77', '47', '76', '75', '69', '29...</td>
      <td>['24', '70', '19', '13', '30', '10']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1619', '7342', '3064', '9213', '8525']</td>
      <td>['810', '2438', '5659', '1844', '9262']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['1', '3']</td>
      <td>['1', '2']</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>4</th>
      <td>81294159</td>
      <td>1.0</td>
      <td>0.5</td>
      <td>11</td>
      <td>6</td>
      <td>2</td>
      <td>112.0</td>
      <td>['75', '29', '49', '122', '36', '11']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['477', '9826', '5808', '644', '2747']</td>
      <td>['5483', '2199', '5424', '1511', '7751']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1', '4', '2']</td>
      <td>1</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
<p>5 rows × 24 columns</p>
</div>

In [15]:
genders = Counter(user_feature_all['gender'])
genders

Counter({0.0: 35594, 0.5: 7768063, 1.0: 3616382})

In [21]:
user_feature_all.to_csv('data/user_feature_all_stage1.csv', columns=column, index=False)

In [2]:
user_feature_all = pd.read_csv('data/user_feature_all_stage1.csv')

In [3]:
user_feature_all.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>uid</th>
      <th>age</th>
      <th>gender</th>
      <th>marriageStatus</th>
      <th>education</th>
      <th>consumptionAbility</th>
      <th>LBS</th>
      <th>interest1</th>
      <th>interest2</th>
      <th>interest3</th>
      <th>...</th>
      <th>kw3</th>
      <th>topic1</th>
      <th>topic2</th>
      <th>topic3</th>
      <th>appIdInstall</th>
      <th>appIdAction</th>
      <th>ct</th>
      <th>os</th>
      <th>carrier</th>
      <th>house</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>26325489</td>
      <td>0.8</td>
      <td>1.0</td>
      <td>11</td>
      <td>7</td>
      <td>2</td>
      <td>950.0</td>
      <td>['93', '70', '77', '86', '109', '47', '75', '6...</td>
      <td>['46', '19', '13', '29']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['9826', '105', '8525', '5488', '7281']</td>
      <td>['9708', '5553', '6745', '7477', '7150']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>2</td>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1184123</td>
      <td>0.4</td>
      <td>0.5</td>
      <td>['5', '13']</td>
      <td>2</td>
      <td>1</td>
      <td>803.0</td>
      <td>['75', '29']</td>
      <td>33</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['4391', '9140', '5669', '1348', '4388']</td>
      <td>['9401', '7724', '1380', '8890', '7153']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>76072711</td>
      <td>0.2</td>
      <td>0.5</td>
      <td>['13', '10']</td>
      <td>5</td>
      <td>1</td>
      <td>927.0</td>
      <td>['70', '12', '28', '106', '59', '49', '41', '6...</td>
      <td>['51', '22', '79', '81', '70', '6', '21', '4',...</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1502', '5488', '9826', '2187', '8088']</td>
      <td>['5005', '9154', '2756', '5612', '4209']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>3</th>
      <td>63071413</td>
      <td>0.8</td>
      <td>0.5</td>
      <td>11</td>
      <td>7</td>
      <td>1</td>
      <td>486.0</td>
      <td>['93', '70', '77', '47', '76', '75', '69', '29...</td>
      <td>['24', '70', '19', '13', '30', '10']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1619', '7342', '3064', '9213', '8525']</td>
      <td>['810', '2438', '5659', '1844', '9262']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['1', '3']</td>
      <td>['1', '2']</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>4</th>
      <td>81294159</td>
      <td>1.0</td>
      <td>0.5</td>
      <td>11</td>
      <td>6</td>
      <td>2</td>
      <td>112.0</td>
      <td>['75', '29', '49', '122', '36', '11']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['477', '9826', '5808', '644', '2747']</td>
      <td>['5483', '2199', '5424', '1511', '7751']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1', '4', '2']</td>
      <td>1</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
<p>5 rows × 24 columns</p>
</div>

In [5]:
education = Counter(user_feature_all['education'])
education

Counter({0: 113486,
         1: 1366418,
         2: 2787696,
         3: 528555,
         4: 125985,
         5: 391070,
         6: 1969266,
         7: 4137563})

In [6]:
user_feature_all['education'] = user_feature_all['education'] / user_feature_all['education'].max()
user_feature_all.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>uid</th>
      <th>age</th>
      <th>gender</th>
      <th>marriageStatus</th>
      <th>education</th>
      <th>consumptionAbility</th>
      <th>LBS</th>
      <th>interest1</th>
      <th>interest2</th>
      <th>interest3</th>
      <th>...</th>
      <th>kw3</th>
      <th>topic1</th>
      <th>topic2</th>
      <th>topic3</th>
      <th>appIdInstall</th>
      <th>appIdAction</th>
      <th>ct</th>
      <th>os</th>
      <th>carrier</th>
      <th>house</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>26325489</td>
      <td>0.8</td>
      <td>1.0</td>
      <td>11</td>
      <td>1.000000</td>
      <td>2</td>
      <td>950.0</td>
      <td>['93', '70', '77', '86', '109', '47', '75', '6...</td>
      <td>['46', '19', '13', '29']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['9826', '105', '8525', '5488', '7281']</td>
      <td>['9708', '5553', '6745', '7477', '7150']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>2</td>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1184123</td>
      <td>0.4</td>
      <td>0.5</td>
      <td>['5', '13']</td>
      <td>0.285714</td>
      <td>1</td>
      <td>803.0</td>
      <td>['75', '29']</td>
      <td>33</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['4391', '9140', '5669', '1348', '4388']</td>
      <td>['9401', '7724', '1380', '8890', '7153']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>76072711</td>
      <td>0.2</td>
      <td>0.5</td>
      <td>['13', '10']</td>
      <td>0.714286</td>
      <td>1</td>
      <td>927.0</td>
      <td>['70', '12', '28', '106', '59', '49', '41', '6...</td>
      <td>['51', '22', '79', '81', '70', '6', '21', '4',...</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1502', '5488', '9826', '2187', '8088']</td>
      <td>['5005', '9154', '2756', '5612', '4209']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>3</th>
      <td>63071413</td>
      <td>0.8</td>
      <td>0.5</td>
      <td>11</td>
      <td>1.000000</td>
      <td>1</td>
      <td>486.0</td>
      <td>['93', '70', '77', '47', '76', '75', '69', '29...</td>
      <td>['24', '70', '19', '13', '30', '10']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1619', '7342', '3064', '9213', '8525']</td>
      <td>['810', '2438', '5659', '1844', '9262']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['1', '3']</td>
      <td>['1', '2']</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>4</th>
      <td>81294159</td>
      <td>1.0</td>
      <td>0.5</td>
      <td>11</td>
      <td>0.857143</td>
      <td>2</td>
      <td>112.0</td>
      <td>['75', '29', '49', '122', '36', '11']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['477', '9826', '5808', '644', '2747']</td>
      <td>['5483', '2199', '5424', '1511', '7751']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1', '4', '2']</td>
      <td>1</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
<p>5 rows × 24 columns</p>
</div>

In [8]:
consumptionAbility = Counter(user_feature_all['consumptionAbility'])
consumptionAbility

Counter({0: 2545303, 1: 6800781, 2: 2073955})

In [9]:
user_feature_all['consumptionAbility'] = user_feature_all['consumptionAbility'] / user_feature_all['consumptionAbility'].max()
user_feature_all.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>uid</th>
      <th>age</th>
      <th>gender</th>
      <th>marriageStatus</th>
      <th>education</th>
      <th>consumptionAbility</th>
      <th>LBS</th>
      <th>interest1</th>
      <th>interest2</th>
      <th>interest3</th>
      <th>...</th>
      <th>kw3</th>
      <th>topic1</th>
      <th>topic2</th>
      <th>topic3</th>
      <th>appIdInstall</th>
      <th>appIdAction</th>
      <th>ct</th>
      <th>os</th>
      <th>carrier</th>
      <th>house</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>26325489</td>
      <td>0.8</td>
      <td>1.0</td>
      <td>11</td>
      <td>1.000000</td>
      <td>1.0</td>
      <td>950.0</td>
      <td>['93', '70', '77', '86', '109', '47', '75', '6...</td>
      <td>['46', '19', '13', '29']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['9826', '105', '8525', '5488', '7281']</td>
      <td>['9708', '5553', '6745', '7477', '7150']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>2</td>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1184123</td>
      <td>0.4</td>
      <td>0.5</td>
      <td>['5', '13']</td>
      <td>0.285714</td>
      <td>0.5</td>
      <td>803.0</td>
      <td>['75', '29']</td>
      <td>33</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['4391', '9140', '5669', '1348', '4388']</td>
      <td>['9401', '7724', '1380', '8890', '7153']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>76072711</td>
      <td>0.2</td>
      <td>0.5</td>
      <td>['13', '10']</td>
      <td>0.714286</td>
      <td>0.5</td>
      <td>927.0</td>
      <td>['70', '12', '28', '106', '59', '49', '41', '6...</td>
      <td>['51', '22', '79', '81', '70', '6', '21', '4',...</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1502', '5488', '9826', '2187', '8088']</td>
      <td>['5005', '9154', '2756', '5612', '4209']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>3</th>
      <td>63071413</td>
      <td>0.8</td>
      <td>0.5</td>
      <td>11</td>
      <td>1.000000</td>
      <td>0.5</td>
      <td>486.0</td>
      <td>['93', '70', '77', '47', '76', '75', '69', '29...</td>
      <td>['24', '70', '19', '13', '30', '10']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1619', '7342', '3064', '9213', '8525']</td>
      <td>['810', '2438', '5659', '1844', '9262']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['1', '3']</td>
      <td>['1', '2']</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>4</th>
      <td>81294159</td>
      <td>1.0</td>
      <td>0.5</td>
      <td>11</td>
      <td>0.857143</td>
      <td>1.0</td>
      <td>112.0</td>
      <td>['75', '29', '49', '122', '36', '11']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['477', '9826', '5808', '644', '2747']</td>
      <td>['5483', '2199', '5424', '1511', '7751']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1', '4', '2']</td>
      <td>1</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
<p>5 rows × 24 columns</p>
</div>

In [11]:
consumptionAbility = Counter(user_feature_all['consumptionAbility'])
consumptionAbility

Counter({0.0: 2545303, 0.5: 6800781, 1.0: 2073955})

In [12]:
user_feature_all['LBS'] = user_feature_all['LBS'].fillna(user_feature_all['LBS'].mean())
Counter(user_feature_all['LBS'])

In [13]:
user_feature_all['LBS'] = user_feature_all['LBS'] / user_feature_all['LBS'].max()
user_feature_all.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>uid</th>
      <th>age</th>
      <th>gender</th>
      <th>marriageStatus</th>
      <th>education</th>
      <th>consumptionAbility</th>
      <th>LBS</th>
      <th>interest1</th>
      <th>interest2</th>
      <th>interest3</th>
      <th>...</th>
      <th>kw3</th>
      <th>topic1</th>
      <th>topic2</th>
      <th>topic3</th>
      <th>appIdInstall</th>
      <th>appIdAction</th>
      <th>ct</th>
      <th>os</th>
      <th>carrier</th>
      <th>house</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>26325489</td>
      <td>0.8</td>
      <td>1.0</td>
      <td>11</td>
      <td>1.000000</td>
      <td>1.0</td>
      <td>0.952859</td>
      <td>['93', '70', '77', '86', '109', '47', '75', '6...</td>
      <td>['46', '19', '13', '29']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['9826', '105', '8525', '5488', '7281']</td>
      <td>['9708', '5553', '6745', '7477', '7150']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>2</td>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1184123</td>
      <td>0.4</td>
      <td>0.5</td>
      <td>['5', '13']</td>
      <td>0.285714</td>
      <td>0.5</td>
      <td>0.805416</td>
      <td>['75', '29']</td>
      <td>33</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['4391', '9140', '5669', '1348', '4388']</td>
      <td>['9401', '7724', '1380', '8890', '7153']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>76072711</td>
      <td>0.2</td>
      <td>0.5</td>
      <td>['13', '10']</td>
      <td>0.714286</td>
      <td>0.5</td>
      <td>0.929789</td>
      <td>['70', '12', '28', '106', '59', '49', '41', '6...</td>
      <td>['51', '22', '79', '81', '70', '6', '21', '4',...</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1502', '5488', '9826', '2187', '8088']</td>
      <td>['5005', '9154', '2756', '5612', '4209']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>3</th>
      <td>63071413</td>
      <td>0.8</td>
      <td>0.5</td>
      <td>11</td>
      <td>1.000000</td>
      <td>0.5</td>
      <td>0.487462</td>
      <td>['93', '70', '77', '47', '76', '75', '69', '29...</td>
      <td>['24', '70', '19', '13', '30', '10']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1619', '7342', '3064', '9213', '8525']</td>
      <td>['810', '2438', '5659', '1844', '9262']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['1', '3']</td>
      <td>['1', '2']</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>4</th>
      <td>81294159</td>
      <td>1.0</td>
      <td>0.5</td>
      <td>11</td>
      <td>0.857143</td>
      <td>1.0</td>
      <td>0.112337</td>
      <td>['75', '29', '49', '122', '36', '11']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['477', '9826', '5808', '644', '2747']</td>
      <td>['5483', '2199', '5424', '1511', '7751']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1', '4', '2']</td>
      <td>1</td>
      <td>3</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
<p>5 rows × 24 columns</p>
</div>

In [14]:
user_feature_all['LBS'].describe()

count    1.142004e+07
mean     4.459327e-01
std      2.856929e-01
min      0.000000e+00
25%      1.925777e-01
50%      4.262788e-01
75%      6.890672e-01
max      1.000000e+00
Name: LBS, dtype: float64

In [16]:
carrier = Counter(user_feature_all['carrier'])
carrier

Counter({0: 3210617, 1: 5460418, 2: 1176651, 3: 1572353})

In [17]:
user_feature_all['carrier'] = user_feature_all['carrier'] / user_feature_all['carrier'].max()
user_feature_all.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>uid</th>
      <th>age</th>
      <th>gender</th>
      <th>marriageStatus</th>
      <th>education</th>
      <th>consumptionAbility</th>
      <th>LBS</th>
      <th>interest1</th>
      <th>interest2</th>
      <th>interest3</th>
      <th>...</th>
      <th>kw3</th>
      <th>topic1</th>
      <th>topic2</th>
      <th>topic3</th>
      <th>appIdInstall</th>
      <th>appIdAction</th>
      <th>ct</th>
      <th>os</th>
      <th>carrier</th>
      <th>house</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>26325489</td>
      <td>0.8</td>
      <td>1.0</td>
      <td>11</td>
      <td>1.000000</td>
      <td>1.0</td>
      <td>0.952859</td>
      <td>['93', '70', '77', '86', '109', '47', '75', '6...</td>
      <td>['46', '19', '13', '29']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['9826', '105', '8525', '5488', '7281']</td>
      <td>['9708', '5553', '6745', '7477', '7150']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>2</td>
      <td>0.333333</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1184123</td>
      <td>0.4</td>
      <td>0.5</td>
      <td>['5', '13']</td>
      <td>0.285714</td>
      <td>0.5</td>
      <td>0.805416</td>
      <td>['75', '29']</td>
      <td>33</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['4391', '9140', '5669', '1348', '4388']</td>
      <td>['9401', '7724', '1380', '8890', '7153']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>0.333333</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>76072711</td>
      <td>0.2</td>
      <td>0.5</td>
      <td>['13', '10']</td>
      <td>0.714286</td>
      <td>0.5</td>
      <td>0.929789</td>
      <td>['70', '12', '28', '106', '59', '49', '41', '6...</td>
      <td>['51', '22', '79', '81', '70', '6', '21', '4',...</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1502', '5488', '9826', '2187', '8088']</td>
      <td>['5005', '9154', '2756', '5612', '4209']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>1.000000</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>3</th>
      <td>63071413</td>
      <td>0.8</td>
      <td>0.5</td>
      <td>11</td>
      <td>1.000000</td>
      <td>0.5</td>
      <td>0.487462</td>
      <td>['93', '70', '77', '47', '76', '75', '69', '29...</td>
      <td>['24', '70', '19', '13', '30', '10']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1619', '7342', '3064', '9213', '8525']</td>
      <td>['810', '2438', '5659', '1844', '9262']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['1', '3']</td>
      <td>['1', '2']</td>
      <td>1.000000</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>4</th>
      <td>81294159</td>
      <td>1.0</td>
      <td>0.5</td>
      <td>11</td>
      <td>0.857143</td>
      <td>1.0</td>
      <td>0.112337</td>
      <td>['75', '29', '49', '122', '36', '11']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['477', '9826', '5808', '644', '2747']</td>
      <td>['5483', '2199', '5424', '1511', '7751']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1', '4', '2']</td>
      <td>1</td>
      <td>1.000000</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
<p>5 rows × 24 columns</p>
</div>

In [19]:
carrier = Counter(user_feature_all['carrier'])
carrier

Counter({0.0: 3210617,
         0.3333333333333333: 5460418,
         0.6666666666666666: 1176651,
         1.0: 1572353})

In [26]:
house = user_feature_all['house'].fillna('0')
Counter(house)

Counter({'0': 9330110, 1.0: 2089929})

In [27]:
user_feature_all['house'] = user_feature_all['house'].fillna('0')
user_feature_all.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>uid</th>
      <th>age</th>
      <th>gender</th>
      <th>marriageStatus</th>
      <th>education</th>
      <th>consumptionAbility</th>
      <th>LBS</th>
      <th>interest1</th>
      <th>interest2</th>
      <th>interest3</th>
      <th>...</th>
      <th>kw3</th>
      <th>topic1</th>
      <th>topic2</th>
      <th>topic3</th>
      <th>appIdInstall</th>
      <th>appIdAction</th>
      <th>ct</th>
      <th>os</th>
      <th>carrier</th>
      <th>house</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>26325489</td>
      <td>0.8</td>
      <td>1.0</td>
      <td>11</td>
      <td>1.000000</td>
      <td>1.0</td>
      <td>0.952859</td>
      <td>['93', '70', '77', '86', '109', '47', '75', '6...</td>
      <td>['46', '19', '13', '29']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['9826', '105', '8525', '5488', '7281']</td>
      <td>['9708', '5553', '6745', '7477', '7150']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>2</td>
      <td>0.333333</td>
      <td>0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1184123</td>
      <td>0.4</td>
      <td>0.5</td>
      <td>['5', '13']</td>
      <td>0.285714</td>
      <td>0.5</td>
      <td>0.805416</td>
      <td>['75', '29']</td>
      <td>33</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['4391', '9140', '5669', '1348', '4388']</td>
      <td>['9401', '7724', '1380', '8890', '7153']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>0.333333</td>
      <td>0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>76072711</td>
      <td>0.2</td>
      <td>0.5</td>
      <td>['13', '10']</td>
      <td>0.714286</td>
      <td>0.5</td>
      <td>0.929789</td>
      <td>['70', '12', '28', '106', '59', '49', '41', '6...</td>
      <td>['51', '22', '79', '81', '70', '6', '21', '4',...</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1502', '5488', '9826', '2187', '8088']</td>
      <td>['5005', '9154', '2756', '5612', '4209']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>1.000000</td>
      <td>0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>63071413</td>
      <td>0.8</td>
      <td>0.5</td>
      <td>11</td>
      <td>1.000000</td>
      <td>0.5</td>
      <td>0.487462</td>
      <td>['93', '70', '77', '47', '76', '75', '69', '29...</td>
      <td>['24', '70', '19', '13', '30', '10']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1619', '7342', '3064', '9213', '8525']</td>
      <td>['810', '2438', '5659', '1844', '9262']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['1', '3']</td>
      <td>['1', '2']</td>
      <td>1.000000</td>
      <td>0</td>
    </tr>
    <tr>
      <th>4</th>
      <td>81294159</td>
      <td>1.0</td>
      <td>0.5</td>
      <td>11</td>
      <td>0.857143</td>
      <td>1.0</td>
      <td>0.112337</td>
      <td>['75', '29', '49', '122', '36', '11']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['477', '9826', '5808', '644', '2747']</td>
      <td>['5483', '2199', '5424', '1511', '7751']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1', '4', '2']</td>
      <td>1</td>
      <td>1.000000</td>
      <td>0</td>
    </tr>
  </tbody>
</table>
<p>5 rows × 24 columns</p>
</div>

In [15]:
user_feature_all.to_csv('data/user_feature_all_stage2.csv', columns=column, index=False)

In [4]:
user_feature_all = pd.read_csv('data/user_feature_all_stage2.csv')
user_feature_all.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>uid</th>
      <th>age</th>
      <th>gender</th>
      <th>marriageStatus</th>
      <th>education</th>
      <th>consumptionAbility</th>
      <th>LBS</th>
      <th>interest1</th>
      <th>interest2</th>
      <th>interest3</th>
      <th>...</th>
      <th>kw3</th>
      <th>topic1</th>
      <th>topic2</th>
      <th>topic3</th>
      <th>appIdInstall</th>
      <th>appIdAction</th>
      <th>ct</th>
      <th>os</th>
      <th>carrier</th>
      <th>house</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>26325489</td>
      <td>0.8</td>
      <td>1.0</td>
      <td>11</td>
      <td>1.000000</td>
      <td>1.0</td>
      <td>0.952859</td>
      <td>['93', '70', '77', '86', '109', '47', '75', '6...</td>
      <td>['46', '19', '13', '29']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['9826', '105', '8525', '5488', '7281']</td>
      <td>['9708', '5553', '6745', '7477', '7150']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>2</td>
      <td>0.333333</td>
      <td>0.0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1184123</td>
      <td>0.4</td>
      <td>0.5</td>
      <td>['5', '13']</td>
      <td>0.285714</td>
      <td>0.5</td>
      <td>0.805416</td>
      <td>['75', '29']</td>
      <td>33</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['4391', '9140', '5669', '1348', '4388']</td>
      <td>['9401', '7724', '1380', '8890', '7153']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>0.333333</td>
      <td>0.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>76072711</td>
      <td>0.2</td>
      <td>0.5</td>
      <td>['13', '10']</td>
      <td>0.714286</td>
      <td>0.5</td>
      <td>0.929789</td>
      <td>['70', '12', '28', '106', '59', '49', '41', '6...</td>
      <td>['51', '22', '79', '81', '70', '6', '21', '4',...</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1502', '5488', '9826', '2187', '8088']</td>
      <td>['5005', '9154', '2756', '5612', '4209']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1']</td>
      <td>1</td>
      <td>1.000000</td>
      <td>0.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>63071413</td>
      <td>0.8</td>
      <td>0.5</td>
      <td>11</td>
      <td>1.000000</td>
      <td>0.5</td>
      <td>0.487462</td>
      <td>['93', '70', '77', '47', '76', '75', '69', '29...</td>
      <td>['24', '70', '19', '13', '30', '10']</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['1619', '7342', '3064', '9213', '8525']</td>
      <td>['810', '2438', '5659', '1844', '9262']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['1', '3']</td>
      <td>['1', '2']</td>
      <td>1.000000</td>
      <td>0.0</td>
    </tr>
    <tr>
      <th>4</th>
      <td>81294159</td>
      <td>1.0</td>
      <td>0.5</td>
      <td>11</td>
      <td>0.857143</td>
      <td>1.0</td>
      <td>0.112337</td>
      <td>['75', '29', '49', '122', '36', '11']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>...</td>
      <td>NaN</td>
      <td>['477', '9826', '5808', '644', '2747']</td>
      <td>['5483', '2199', '5424', '1511', '7751']</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>['3', '1', '4', '2']</td>
      <td>1</td>
      <td>1.000000</td>
      <td>0.0</td>
    </tr>
  </tbody>
</table>
<p>5 rows × 24 columns</p>
</div>

In [59]:
x = user_feature_all['marriageStatus'][1]
for e in x[1:-1].split(','):
    print(int(e.replace('\'', '')))

5
13

In [26]:
s = set()
x = user_feature_all['marriageStatus'][1]
for e in x[1:-1].split(','):
    print(e)

TypeError: 'str' object is not callable

In [62]:
Counter(user_feature_all['marriageStatus'])

Counter({'0': 777224,
         '10': 4262449,
         '11': 3621989,
         '13': 333334,
         '14': 207,
         '15': 269446,
         '3': 179,
         '8': 3,
         "['12', '13', '10']": 103,
         "['12', '13', '9']": 8841,
         "['12', '13']": 189100,
         "['13', '10', '9']": 4,
         "['13', '10']": 1397672,
         "['13', '15', '10']": 3,
         "['13', '15']": 72971,
         "['13', '9']": 102224,
         "['15', '10']": 20,
         "['2', '13', '10']": 1,
         "['2', '13', '9']": 6341,
         "['2', '13']": 105230,
         "['5', '13', '10']": 6,
         "['5', '13', '9']": 3366,
         "['5', '13']": 85440,
         "['6', '13', '10']": 5,
         "['6', '13', '9']": 16303,
         "['6', '13']": 167577,
         nan: 1})

In [72]:
status = set()
for e in user_feature_all['marriageStatus'].fillna('999'):
    if e.isdigit():
        status.add(int(e))
    else:
        for ee in e[1:-1].split(','):
            status.add(int(ee.replace('\'', '')))
status

{0, 2, 3, 5, 6, 8, 9, 10, 11, 12, 13, 14, 15, 999}